performance/reports/runs/posts-2026-08-16T06-41-08/summary.txt
     ✓ login 200
     ✓ post list 200
     ✓ post detail 200
     ✓ post search 200
     ✓ post create 2xx
     ✓ post update 200
     ✓ post delete 200

   ✓ checks.........................: 100.00% ✓ 253      ✗ 0   
     data_received..................: 311 kB  4.5 kB/s
     data_sent......................: 100 kB  1.4 kB/s
     http_req_blocked...............: avg=55.43µs  min=0s      med=0s      max=1.86ms   p(90)=0s       p(95)=0s       p(99)=1.34ms  
     http_req_connecting............: avg=12.24µs  min=0s      med=0s      max=518.7µs  p(90)=0s       p(95)=0s       p(99)=518.7µs 
     http_req_duration..............: avg=239.36ms min=6.74ms  med=24.02ms max=3.61s    p(90)=119.7ms  p(95)=1.85s    p(99)=3.61s   
       { expected_response:true }...: avg=239.36ms min=6.74ms  med=24.02ms max=3.61s    p(90)=119.7ms  p(95)=1.85s    p(99)=3.61s   
     ✓ { feature:auth }.............: avg=3.57s    min=3.51s   med=3.61s   max=3.61s    p(90)=3.61s    p(95)=3.61s    p(99)=3.61s   
     ✓ { feature:board }............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:chat }.............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:comment }..........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:friend }...........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:hot }..............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:mypage }...........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:notification }.....: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:post }.............: avg=101.95ms min=6.74ms  med=23.46ms max=1.85s    p(90)=48.15ms  p(95)=141.01ms p(99)=1.85s   
     ✓ { feature:reaction }.........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:school }...........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:scrap }............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:timetable }........: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { op:auth }..................: avg=3.57s    min=3.51s   med=3.61s   max=3.61s    p(90)=3.61s    p(95)=3.61s    p(99)=3.61s   
     ✗ { op:read }..................: avg=105.85ms min=6.74ms  med=23.19ms max=1.85s    p(90)=47.76ms  p(95)=178.23ms p(99)=1.85s   
     ✓ { op:write }.................: avg=42.69ms  min=19.94ms med=39.41ms max=142.52ms p(90)=49.64ms  p(95)=79.42ms  p(99)=129.9ms 
     ✓ { page:0 }...................: avg=120.16ms min=6.79ms  med=16.54ms max=1.85s    p(90)=29.68ms  p(95)=573.81ms p(99)=1.83s   
     ✓ { page:1 }...................: avg=623.63ms min=6.74ms  med=21.23ms max=1.85s    p(90)=1.85s    p(95)=1.85s    p(99)=1.85s   
     ✓ { page:2 }...................: avg=465.61ms min=8.84ms  med=17.15ms max=1.79s    p(90)=1.79s    p(95)=1.79s    p(99)=1.79s   
     ✓ { page:3 }...................: avg=320.25ms min=7.88ms  med=19.33ms max=1.79s    p(90)=932.45ms p(95)=1.36s    p(99)=1.71s   
     ✓ { page:4 }...................: avg=469.82ms min=12.08ms med=33.63ms max=1.79s    p(90)=1.27s    p(95)=1.53s    p(99)=1.74s   
   ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 253 
     http_req_receiving.............: avg=347.48µs min=0s      med=303.8µs max=2.04ms   p(90)=799.2µs  p(95)=1.06ms   p(99)=1.82ms  
     http_req_sending...............: avg=34.93µs  min=0s      med=0s      max=1.01ms   p(90)=0s       p(95)=508.97µs p(99)=806.59µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=238.98ms min=6.74ms  med=23.74ms max=3.61s    p(90)=119.7ms  p(95)=1.85s    p(99)=3.61s   
     http_reqs......................: 253     3.643536/s
     ✓ { feature:auth }.............: 10      0.144013/s
     ✓ { feature:board }............: 0       0/s
     ✓ { feature:chat }.............: 0       0/s
     ✓ { feature:comment }..........: 0       0/s
     ✓ { feature:friend }...........: 0       0/s
     ✓ { feature:hot }..............: 0       0/s
     ✓ { feature:mypage }...........: 0       0/s
     ✓ { feature:notification }.....: 0       0/s
     ✓ { feature:post }.............: 243     3.499523/s
     ✓ { feature:reaction }.........: 0       0/s
     ✓ { feature:school }...........: 0       0/s
     ✓ { feature:scrap }............: 0       0/s
     ✓ { feature:timetable }........: 0       0/s
     ✓ { op:auth }..................: 10      0.144013/s
     ✓ { op:read }..................: 228     3.283503/s
     ✓ { op:write }.................: 15      0.21602/s
     ✓ { page:0 }...................: 35      0.504047/s
     ✓ { page:1 }...................: 12      0.172816/s
     ✓ { page:2 }...................: 8       0.115211/s
     ✓ { page:3 }...................: 6       0.086408/s
     ✓ { page:4 }...................: 4       0.057605/s
     iteration_duration.............: avg=10.07s   min=4.95s   med=9.41s   max=16.23s   p(90)=14.01s   p(95)=14.86s   p(99)=16.03s  
     iterations.....................: 65      0.936086/s
     vus............................: 1       min=1      max=10
     vus_max........................: 10      min=10     max=10